import "./App.css";
import Container from "./components/Container/Container";
import Header from "./components/Header/Header";
import HeroSection from "./components/HeroSection/HeroSection";
import aboutSvg from "/about.svg";
import shadiSvg from "/shadi.svg";

function App() {
  return (
    <>
      <div className="persian bg-gray-50">
        <Header />
        <HeroSection />
        <Container>
          <div>
            <h2 className="text-2xl text-center text-gray-800 mt-16">
              درباره تاراز
            </h2>
            <p className="text-center text-gray-600 text-lg mt-4 px-4">
              هدف تاراز ارائه‌ی آموزش رایگان و همگانی است. ما با معیارهایی فراتر
              از آموزش سنتی رایج به دنبال آموزش اصول علمی در کنار مهارت‌های عملی
              هستیم و معتقدیم که هر دانش‌آموزی باید فرصت دنبال کردن علایقش را
              داشته باشد، خواه این به معنای گرفتن مدرکی دانشگاهی باشد یا کسب
              مهارتی که به آمادگی‌اش برای ورود به بازار کار کمک می‌کند.
            </p>
            <p className="text-center text-gray-600 text-lg mt-4 px-4">
              تاراز در کنار برنامه‌های آموزشی، بر رشد شخصی و توسعه‌ی فردی
              دانش‌آموزانش هم سرمایه‌گذاری می‌کند. ما در دوره‌هایی نظیر نویسندگی
              خلاق، فلسفه، طراحی گرافیک و جلسات پشتیبانی، دانش‌آموزان را به
              آن‌چه که برای درک بهتر خود و مقابله با چالش‌هاشان نیاز دارند، مجهز
              می‌کنیم. همچنین با تأکید بر اهمیت خودمراقبتی، به آن‌ها آموزش
              می‌دهیم که چطور مهارت‌های ارتباطی‌شان را تقویت کرده و با اطمینان
              خود را در محیط‌های مختلف حرفه‌ای و آموزشی نشان دهند.
            </p>
            <p className="text-center text-gray-600 text-lg mt-4 px-4">
              هدف تاراز ساختن یک محیط پرورشی است که دانش‌آموزان در آن احساس
              ارزشمندی و حمایت کنند. ما متعهدیم که نیازهای فردی دانش‌آموزان‌مان
              را برطرف کنیم و اطمینان حاصل کنیم که تمام‌شان تحصیلات عادلانه و
              برابری که شایسته‌اش هستند را دریافت می‌کنند.
            </p>
          </div>
          <img src={aboutSvg} alt="About" className="w-full mt-16" />
        </Container>
        <Container>
          <div>
            {/* avatar shadi */}
            <img
              src={shadiSvg}
              alt="Shadi"
              className="w-32 h-32 mx-auto mt-16"
            />
            <h3 className="text-xl text-center text-gray-800 mt-4">
              شادی مهجوم
            </h3>
            <h4 className="text-lg text-center text-gray-600 mt-2 mb-16">
              بنیان‌گزار
            </h4>
            <p className="text-center text-gray-600 text-lg mt-4 px-4">
              حدود یک سال پیش، سر کلاس دانشگاه نشسته بودم و به همکلاسی‌هایم از
              تجربه‌ی کمک‌های داوطلبانه‌شان می‌گفتند گوش می‌دادم. گفت‌وگوهاشان
              دغدغه‌هایم را در برابر چشمم مجسم کرده بود. فکر کردم من چه کاری
              می‌توانم انجام دهم که متناسب با خواسته‌های قلبی‌ام باشد؟ {" "}
            </p>
            <p className="text-center text-gray-600 text-lg mt-4 px-4">
              از آن‌جا که فکر ایران لحظه‌ای از ذهنم بیرون نمی‌رود، تصمیم گرفتم
              کاری را شروع کنم که مرتبط با سرزمینی باشد که سال‌هاست به‌ناچار از
              آن دورم. در افکارم عمیق‌تر شدم و دیدم برای شروع این کار ابزارهایی
              هم دارم: علاقه‌ام به دانش و حس مسئولیت برای به اشتراک گذاشتن
              فرصت‌های آموزشی که در تمام مسیر مهاجرتم کسب کرده بودم. {" "}
            </p>
            <p className="text-center text-gray-600 text-lg mt-4 px-4">
              من در سن ۱۶ سالگی ایران را ترک کردم و در مسیر مهاجرتم با دنیای
              جدیدی از فرصت‌ها، تجربه‌ها و انسان‌ها آشنا شدم و آموختم. از
              انسان‌هایی آموختم که نه تنها در تصمیم‌های مهم زندگی راهنمایم بودند
              بلکه همواره برای پیدا کردن هدفم در زندگی و رسیدن به آن همراهی‌ام
              کردند. این‌جا بود که ایده‌ی ساختن یک مجموعه‌ی آموزشی مجازی به ذهنم
              رسید. ساختاری که مرزهای جغرافیایی محدودش نمی‌کنند و هر دانش‌آموزی
              صرف‌نظر از موقعیت اجتماعی و اقتصادی‌اش، امکان استفاده از فرصت‌هایش
              را دارد.‌ {" "}
            </p>
            <p className="text-center text-gray-600 text-lg mt-4 px-4">
              یک سالی از شروع کار تاراز می‌گذرد. با چالش‌های متفاوتی روبه‌رو
              شدیم که مهم‌ترین‌شان، فقدان ارتباط کامل بین فضای کلاس درس و
              مهارت‌های کاربردی است. مهارت‌هایی که در پیوند با تکنولوژی دنیای
              امروز ما هستند و می‌توانند نقشی اساسی در ساختن دنیایی بهتر داشته
              باشند. بنابراین قدم بعدی تاراز، شناخت کافی از نیازهای دانش‌آموزان
              و ارائه کردن کلاس‌های آموزشی متنوع است. کلاس‌هایی که امکان
              ایده‌پردازی و پرورش ذهنی پرسشگر را به دانش‌آموزان می‌دهند و آن‌ها
              را با دنیای بیرون از چارچوب کلاس درس آشنا می‌کنند؛ به این امید که
              این شوق نیرویی تازه برای حرکت به سوی اهداف‌شان باشد.{" "}
            </p>
          </div>
        </Container>
      </div>
    </>
  );
}

export default App;
